tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

brew 'cask'

# GNU utilities
brew 'coreutils'
brew 'findutils'
brew 'moreutils'

# OS overrides
brew 'grep'
brew 'gnu-sed', args: ['with-default-names']
brew "tmux"
brew "tmux-mem-cpu-load"
brew 'vim', args: ['override-system-vi']

# Shells
brew 'bash'
brew 'fish'

# Git
brew 'git'
#brew 'diff-so-fancy'

# Utilities
brew 'ack'
brew 'cmake'
brew 'fzf'
brew 'grc'
brew 'htop'
brew 'neovim'
brew 'p7zip'
brew 'rename'
brew 'tree'
brew 'the_silver_searcher'
brew 'unrar'
brew 'xz'

# Ruby
brew 'rbenv'
brew 'rbenv-bundler'
brew 'ruby-build'

# Node
brew 'nvm'

##
## Applications

cask_args appdir: '/Applications'

cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'github'
cask 'iterm2'
cask 'ngrok'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'vlc'
cask 'visual-studio-code'
cask 'whatsapp'